app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.possible_ratings()
    @title = nil
    @date = nil
    @checked = @all_ratings
    if params[:sorted] != nil
      session[:sorted] = params[:sorted]
    end
    if params[:ratings] != nil
      @movies = Movie.find(:all, :conditions => {:rating => params[:ratings].keys}, :order => session[:sorted])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'R') ORDER BY release_date